benchmark/results/native_wrk_auth_20260220_141119.txt
Running 30s test @ http://127.0.0.1:9080/bench-auth
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us     nan%
    Req/Sec     0.00      0.00     0.00       nan%
  Latency Distribution
     50%    0.00us
     75%    0.00us
     90%    0.00us
     99%    0.00us
  0 requests in 30.07s, 31.64KB read
Requests/sec:      0.00
Transfer/sec:      1.05KB