benchmark/results/native_wrk_baseline_20260220_140335.txt
Running 15s test @ http://127.0.0.1:3000/
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34ms    0.92ms  31.16ms   92.78%
    Req/Sec    15.28k     1.11k   29.66k    96.68%
  Latency Distribution
     50%    1.31ms
     75%    1.43ms
     90%    1.67ms
     99%    3.21ms
  2288954 requests in 15.10s, 224.84MB read
Requests/sec: 151585.53
Transfer/sec:     14.89MB