benchmark/results/native_wrk_plain_20260220_140335.txt
Running 30s test @ http://127.0.0.1:9080/bench
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.57ms  810.82us  23.01ms   94.78%
    Req/Sec     4.41k   219.38     4.77k    85.32%
  Latency Distribution
     50%    4.58ms
     75%    4.73ms
     90%    4.87ms
     99%    5.77ms
  1321231 requests in 30.10s, 219.24MB read
Requests/sec:  43889.95
Transfer/sec:      7.28MB