benchmark/results/native_wrk_plain_20260220_141119.txt
Running 30s test @ http://127.0.0.1:9080/bench
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.80ms  812.53us  26.76ms   95.88%
    Req/Sec     4.20k   163.08     4.51k    88.47%
  Latency Distribution
     50%    4.83ms
     75%    4.97ms
     90%    5.08ms
     99%    5.40ms
  1258195 requests in 30.10s, 208.78MB read
Requests/sec:  41794.50
Transfer/sec:      6.94MB