benchmark/results/native_wrk_stress_20260220_141119.txt
Running 30s test @ http://127.0.0.1:9080/bench
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.06ms   21.67ms 147.42ms   79.53%
    Req/Sec     4.01k   353.31     5.50k    71.21%
  Latency Distribution
     50%    5.89ms
     75%   34.99ms
     90%   56.23ms
     99%   74.51ms
  1200510 requests in 30.10s, 199.21MB read
Requests/sec:  39879.05
Transfer/sec:      6.62MB