benchmark/results/wrk_apisix_ramp_100_20260220_134606.txt
Running 20s test @ http://localhost:8080/bench/plain
  20 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.08ms  355.30us  19.05ms   78.92%
    Req/Sec     4.68k   457.58     9.20k    78.38%
  Latency Distribution
     50%    1.05ms
     75%    1.24ms
     90%    1.46ms
     99%    1.96ms
  1873551 requests in 20.10s, 550.31MB read
  Non-2xx or 3xx responses: 1873551
Requests/sec:  93210.62
Transfer/sec:     27.38MB